[{"Title":"JIT Students attended 19th National Conference on E-Governance","CreatedDate":"15-02-2016","Content":[{"ImageURL":[{"URL":"images/FirstYear/DrApte.jpg","ImageTitle":""}]},{"Paregraphs":[{"Text":"JIT students and faculties attended and interacted with speakers at the 19th national conference on E- Governance which was held in Nagpur on January 21 and 22. The two-day Conference was organized by the DARPG and Department of Electronics and Information Technology (DeitY), Government of India in association with the Government of Maharashtra. The Conference had six plenary sessions on topics such as Governance with Accountability Transparency &amp; Innovation (GATI) for Citizen-Centric Services, Financial Inclusion- Jan Dhan, Aadhaar and Mobile (JAM) and Direct Benefit Transfer (DBT), Urban Governance in Smart Cities, Cyber Security Framework for Citizen Centric Services, Decade of E-Governance- Way Ahead and Technology Enabled Education. The Conference served as an effective forum for IT professionals of the Central and State Governments, Software Solution Providers and the Industry to interact and analyze various solution frameworks. Many new initiatives in E-Governance sector have emerged out of this Conference."}]},{"Paregraphs":[{"Text":"3 rd Year Students of Computer Science and Engineering from Jhulelal Institute of Technology were given an opportunity to attend this conference and to update their knowledge about Technologies which are used to make India “Digital “and to motivate them to work in this field. JIT students could attend the conference with the support of Mr. Raghupathi. N. Cavale, Vice-President and Head of India Business at Infosys, and he also is a member of cooperate advisory board of JIT. During the visit, along with the students Prof Mona Mulchandani, HOD, CSE, JIT, Dr. D. Bhowmick, Vice Principal, JIT and Dr. Pramod Patil, Principal, JIT, Ms. Madhavi Wairagade, Director HR &amp; Administration interacted with Mr. Cavale. Mr. Cavale motivated students to work in the direction of entrepreneurship as youth startups can serve to be most innovative ideas in E- Governance field. The visit had a great support of Mr. Pramod Pampatwar Director Technical, JIT, Ms. Madhavi Wairagade, Director HR &amp; Administration, JIT, Mr. Virendra Kukreja, Secretary, JIT and Mr. Mahesh Sadhwani, Chairman, JIT."}]}]}]